snlkuharlocal/src/Catalogs/КодыGLN/КодыGLN.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КодыGLN</name>
  <attributes>
    <name>ВладелецКодов</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>GLN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачалоДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользованоКодов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛимитКодов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

snlkuharlocal/src/Enums/ТипыКодовМаркировки/ТипыКодовМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКодовМаркировки</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Набор</name>
  </enumValues>
  <enumValues>
    <name>ЛогистическаяУпаковка</name>
  </enumValues>
  <enumValues>
    <name>АТК</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Catalogs/КодыGLN/ManagerModule.bsl
Функция ПолучитьКоличествоИспользованныхКодов(Ссылка) Экспорт
	GLN = ПолучитьРеквизитШапки(Ссылка, "GLN");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "	
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Ссылка,
	|	Наименование
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров
	|ГДЕ
	|	ПОДСТРОКА(Наименование, 1, 10) 	= &GLN
	|	И ТипКода = ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.ЛогистическаяУпаковка)
	|УПОРЯДОЧИТЬ ПО
	|	Наименование УБЫВ
	|";	
	
	Запрос.УстановитьПараметр("GLN", "0" + Лев(GLN, 9));
	
	Результат = 0;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Наименование) Тогда
		Код = СокрЛП(Выборка.Наименование);
		Код = Сред(Код,11);
		
		Результат = ПривестиСтрокуКЧислу(Лев(Код,7));		
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //ПолучитьКоличествоИспользованныхКодов(Ссылка) Экспорт

Функция ПолучитьДействующийГЛН(ВладелецКодов) Экспорт
	Результат = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	GLN
	|ИЗ
	|	Справочник.КодыGLN КАК КодыGLN
	|ГДЕ
	|	ВладелецКодов = &ВладелецКодов
	|	И НачалоДействия <= &ТекущаяДата 
	|	И (ОкончаниеДействия >= &ТекущаяДата ИЛИ ОкончаниеДействия=ДАТАВРЕМЯ(1,1,1)) 
	|УПОРЯДОЧИТЬ ПО
	|	НачалоДействия
	|";               
	
	Запрос.УстановитьПараметр("ТекущаяДата", 	НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("ВладелецКодов", 	ВладелецКодов);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.GLN) Тогда
		Результат = Выборка.GLN;	
	Иначе
		Если ТипЗнч(ВладелецКодов) = Тип("СправочникСсылка.Организации") Тогда
			Результат = ПолучитьРеквизитШапки(ВладелецКодов, "GLN");					
		КонецЕсли;		
	КонецЕсли;
	
	Возврат Результат;	
КонецФункции //ПолучитьДействующийГЛН(ВладелецКодов)
